
&НаКлиенте
Процедура ВыполнитьТестирование(Команда)
	
	ВыполнитьТестированиеНаСервере();
	//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(нСтр("ru = 'Тестирование выполнено'"));
	
	Элементы.Результат.Картинка = БиблиотекаКартинок.ВыполненоУспешно;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьТестированиеНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Тестировать();
	//TODO: подумать как получать результаты тестирования
	//РезультатТестирования = ОбработкаОбъект.ДополнительныеСвойства.ОписаниеОтчета.Отчет;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВыполнитьТестирование(Неопределено);	
	
КонецПроцедуры
